JerrickRowe/stm32-bootloader/projects/STM32F407-OWL/source/main.c
bool UpgradeFromSD( void ){
	FRESULT res;
	FILINFO file_info;
	FILINFO fno;
	
	if( IsUpgradeFileExists() == false ){
		return false;
	}
	PRINT_RAW("Opening \"%s\"......", UPGRADE_FILENAME);
	res = f_open(&upgrade_file, UPGRADE_FILENAME, FA_OPEN_EXISTING | FA_READ);
	if( res != FR_OK ){
		PRINT_RAW("FAILED\r\n");
		return false;
	}
	PRINT_RAW("DONE\r\n");

//	UINT br = 0;
//	static uint8_t buff[512];
//	res = f_read( &upgrade_file, buff, 512, &br );
//	printMem( "upgrade_file #0", buff, 512 );

	if( VerifyUpgradeFile( &upgrade_file ) == false ){
		return false;
	}
	if( Copy_File_To_App1( &upgrade_file ) == false ){
		return false;
	}
	f_close( &upgrade_file );

	led_setAllRGB( RGB(0,0,50) );

	if( IsApp1Jumpable() == false ){
		return false;
	}

	PRINT_RAW("Backing up......");
	res = f_unlink( BACKUP_FILENAME );
	res = f_rename( UPGRADE_FILENAME, BACKUP_FILENAME );
	if( res != FR_OK ){
		PRINT_RAW("FAILED\r\n");
	}else{
		PRINT_RAW("DONE\r\n");
		f_chmod( BACKUP_FILENAME, AM_ARC|AM_SYS|AM_HID, AM_ARC|AM_SYS|AM_HID );
	}

	
	PRINT_RAW("Backup filename: %s\r\n", BACKUP_FILENAME);
	return true;
}






void LaunchApp1( void ){
	do{
		if( renew_freefile != true ){
			break;
		}
		FRESULT res;
		FILINFO fno;
		const char* path_freefile = "SD:/FREESPAC.E";
		PRINT_RAW( "Freefile should be renewed....." );
		res = f_stat(path_freefile, &fno);
		if(res != FR_OK){
			PRINT_INF("NOTFOUND");
			break;
		}
		PRINT_RAW("FOUND\r\n");
		PRINT_RAW("  %s %dbytes\r\n", fno.fname, fno.fsize );
		PRINT_RAW("  Delete %s........", path_freefile );
		res = f_chmod( path_freefile, 0, AM_RDO );
		if( res != FR_OK ){
			PRINT_RAW( "chmod failed...." );
		}
		res = f_unlink( path_freefile );
		if( res == FR_OK ){
			PRINT_RAW( "Done\r\n" );
		}else{
			PRINT_RAW( "Failed\r\n" );
		}
	}while(0);
	PRINT_RAW("Launching App 1.\r\n");
	SD_DeInit();
	GPIO_DeInit();
	bsp_power_HoldPower();
	// Launch application 
	Bootloader_JumpToApp1();
}

__ALIGN_BEGIN USB_OTG_CORE_HANDLE USB_OTG_dev __ALIGN_END;
static bool USB_OTG( void ){
	static enum{
		STARTUP = 0,
		CHECK_USB_VOLTAGE,
		INIT_USB,
		RUNNING,
	}sta = STARTUP;
	switch( sta ){
		case STARTUP:{
			PRINT_INF( "USB-OTG Startup" );

			sta = CHECK_USB_VOLTAGE;
		}
		case CHECK_USB_VOLTAGE:{

			if( 1 ){
				led_setAllRGB( RGB(0,0,50) );
				sta = INIT_USB;
				return true;
			}
			break;
		}
		case INIT_USB:{
			USBD_Init(&USB_OTG_dev,
			#ifdef USE_USB_OTG_HS
				USB_OTG_HS_CORE_ID,
			#else
				USB_OTG_FS_CORE_ID,
			#endif
				&USR_desc, &USBD_MSC_cb, &USR_cb
			);
			// The 2nd initialization gets device to be discovered by PC
			USBD_Init(&USB_OTG_dev,
			#ifdef USE_USB_OTG_HS
				USB_OTG_HS_CORE_ID,
			#else
				USB_OTG_FS_CORE_ID,
			#endif
				&USR_desc, &USBD_MSC_cb, &USR_cb
			);
			sta = RUNNING;
			return true;
		}
		case RUNNING:{
			if( USBD_USR_IsStorageActive() ){
				led_toggling( RGB(0,0,50), RGB(0,0,100), 50 );
			}else{
				led_setAllRGB( RGB(0,0,50) );
			}
			if( !USBD_USR_IsReleased() ){
				return true;
			}
			break;
		}
		default:{
			break;
		}
	}
	PRINT_INF( "USB-OTG released" );
	led_setAllRGB( RGB(0,0,0) );
	// float usb_voltage;
	// do{
	// 	usb_voltage = bsp_power_GetExtPowerVoltage();
	// 	// PRINT_INF( "usb_voltage = %.2f", usb_voltage );
	// 	HAL_Delay(200);
	// }while( usb_voltage > 3.0f );
	// led_setAllRGB( RGB(0,0,0) );
	if( !USBD_USR_HostNotFound() ){
		HAL_Delay(100);
		bsp_power_ReleasePower();
		HAL_Delay(100);
		PRINT_INF( "Failed to release power" );
	}

	sta = STARTUP;
	return false;
}


/* Main ----------------------------------------------------------------------*/
int main(void)
{
    HAL_Init();
    GPIO_Startup();

	Console_Init();
	
	led_init();
    PRINT_RAW("%s\r\n",get_version_string());
	led_allon();
	led_setAllRGB( RGB(255,0,0) );
    HAL_Delay(200);
	led_setAllRGB( RGB(0,255,0) );
    HAL_Delay(200);
	led_setAllRGB( RGB(0,0,255) );
    HAL_Delay(200);
	led_setAllRGB( RGB(0,0,0) );
	
	if( MountFilesystem() == true ){
//		PRINT_INF(	"List files:" );
//		ls( 1, "SD:" );
		
		// Try to upgrade from SD card
		if( UpgradeFromSD() == true ){
			// renew_freefile = true;
//			LaunchApp1();
		}

		// Run USB-OTG service
		float usb_volt = bsp_power_GetExtPowerVoltage();
		PRINT_INF(	"USB voltage = %.2fV", usb_volt );
		if( usb_volt>3.0f && usb_volt<7.0f ){
			while( USB_OTG() );
		}

		// No need to upgrade or upgrade failed.
		if( IsApp1Jumpable() == true ){
			LaunchApp1();
		}

		// App is broken, try to recover from backup file
		if( IsBackupFileExists() == true ){
			FRESULT res;
			PRINT_RAW("Recover backup file......");
			res = f_rename( BACKUP_FILENAME, UPGRADE_FILENAME );
			if( res == FR_OK ){
				PRINT_RAW("DONE\r\n");
				if( UpgradeFromSD() == true ){
					// renew_freefile = true;
					LaunchApp1();
				}
			}else{
				PRINT_RAW("FAILED\r\n");
			}
		}
	}else{
		// Try to run app without SD card.
		if( IsApp1Jumpable() == true ){
			LaunchApp1();
		}
	}
	
	// Fatal: no app, no backup file available, upgrade is needed.
    PRINT_INF("No application available.");
    while(1){
		led_setAllRGB( RGB(20,20,20) );
		HAL_Delay(150);
		led_setAllRGB( RGB(0,0,0) );
		HAL_Delay(150);
    }
}

/*** Bootloader ***************************************************************/

void Enter_Bootloader(void)
{
//    FRESULT  res;
//    UINT     num;
//    uint8_t  i;
//    uint8_t  status;
//    uint64_t data;
//    uint32_t cntr;
//    uint32_t addr;
//    char     msg[40] = {0x00};

//    /* Check for flash write protection */
//    if(Bootloader_GetProtectionStatus() & BL_PROTECTION_WRP)
//    {
//        PRINT_INF("Application space in flash is write protected.");
//        PRINT_INF("Press button to disable flash write protection...");
//        LED_R_ON();
//        for(i = 0; i < 100; ++i)
//        {
//            LED_Y_TG();
//            HAL_Delay(50);
//            if(IS_BTN_PRESSED())
//            {
//                PRINT_INF("Disabling write protection and generating system "
//                      "reset...");
//                Bootloader_ConfigProtection(BL_PROTECTION_NONE);
//            }
//        }
//        LED_R_OFF();
//        LED_Y_OFF();
//        PRINT_INF("Button was not pressed, write protection is still active.");
//        PRINT_INF("Exiting Bootloader.");
//        return;
//    }

//    /* Initialize SD card */
//    if(SD_Init())
//    {
//        /* SD init failed */
//        PRINT_INF("SD card cannot be initialized.");
//        return;
//    }

